In [1]:
import os
import pandas as pd

Criar um DataFrame atraves de um arquivo csv:

In [42]:
df_contratos = pd.read_csv(os.path.join(os.getcwd(), 'files', 'BaseContratos.csv'), sep=';')
df_clientes = pd.read_csv(os.path.join(os.getcwd(), 'files', 'BaseClientes.csv'), sep=';')

In [44]:
df_contratos

            numero  cod_cliente  status_pagamento data_vencimento
0    1341987320000      9086646                 1      10/01/2020
1    5109115350000      7203116                 1      15/11/2019
2    1364634850000      2950911                 1      07/05/2011
3    1430506640000      8909474                 1      16/03/2019
4        570761429      5683923                 1      08/08/2016
..             ...          ...               ...             ...
995  5062693570000      7900579                 1      20/04/2018
996  1304384850000      8149864                 1      08/09/2018
997  1267517410000      6975405                 1      08/01/2020
998  2600965320000      9030374                 1      11/02/2019
999  1797347560000      8203424                 1      11/02/2019

[1000 rows x 4 columns]

Criar DataFrame a partir de colunas especificas

In [19]:
df_colunas = pd.read_csv(os.path.join(os.getcwd(), 'files', 'BaseContratos.csv'), sep=';', usecols=['cod_cliente', 'numero'])

Transformar dicionarios em DataFrame

In [11]:
dict_teste = {
    'Aluno' : ["Wilfred", "Abbie", "Harry", "Julia", "Carrie"],
    'Faltas' : [3, 4, 2, 1, 4],
    'Prova' : [2, 7, 5, 10, 6],
    'Seminário': [8.5, 7.5, 9.0, 7.5, 8.0]
}

In [12]:
df_dict = pd.DataFrame(dict_teste)

     Aluno  Faltas  Prova  Seminário
0  Wilfred       3      2        8.5
1    Abbie       4      7        7.5
2    Harry       2      5        9.0
3    Julia       1     10        7.5
4   Carrie       4      6        8.0

Merge entre DataFrames

In [13]:
df_merge = pd.merge(df_contratos, df_clientes, how='inner', on='cod_cliente')

Manipulação de dados do DataFrame

In [26]:
df_contratos['data_vencimento'] = pd.to_datetime(df_contratos['data_vencimento'], format='%d/%m/%Y')
df_contratos['data_vencimento'] = df_contratos['data_vencimento'].dt.strftime('%Y-%m-%d')

DataFrame concatenação

In [38]:
df_concat = pd.concat([df_contratos[['cod_cliente']], df_clientes[['cod_cliente']]], ignore_index=True)

Where no DataFrame

In [45]:
df_contratos.loc[df_contratos['numero'] == 1341987320000]

          numero  cod_cliente  status_pagamento data_vencimento
0  1341987320000      9086646                 1      10/01/2020

In [55]:
df_contratos.iloc[999]

numero              1797347560000
cod_cliente               8203424
status_pagamento                1
data_vencimento        11/02/2019
Name: 999, dtype: object